{
  "Intro": "Cinematic close-up, high angle looking down at a modern nightstand with a sleeping person in the blurred background. In the foreground, a smartphone screen displays a bank account balance, but the numbers are dissolving into golden dust and floating away into the dark room like smoke. Moody blue moonlight lighting, hyper-realistic, 8k resolution, symbolizing vanishing wealth.",
  "Part 1": "Wide angle drone shot of the Seoul skyline at dawn. A massive, rusting iron monolithic number '1,400' looms over the skyscrapers like a dystopic monument. Heavy fog rolls through the city streets. The lighting is desaturated and cold, creating an atmosphere of ominous permanence and heavy industrial weight. Cinematic realism.",
  "Part 2": "Macro shot of a South Korean Won coin placed on a heating element. The coin is not melting instantly but slowly warping and sweating liquid metal like a candle. Soft focus background of a blurred kitchen. Warm, dangerous orange glow from beneath, symbolizing the 'boiling frog' effect. High detail texture.",
  "Part 3": "A sleek, dark boardroom table. On top of the table sits a neat graph of interest rates. Underneath the table, hidden in the deep shadows, a large metallic snake is coiling around the legs of the table. Low angle shot, dramatic chiaroscuro lighting, mystery thriller vibe, symbolizing the hidden danger beneath the surface.",
  "Part 4": "A majestic marble Greek pillar labeled 'KOREAN EXPORTS' standing in the middle of a rough, stormy ocean. The pillar has large, deep cracks running through it and chunks are falling into the waves. Dark grey storm clouds overhead, dramatic lightning, cinematic disaster movie style, water splashes and high contrast.",
  "Part 5": "A metaphorical chessboard scene. A gigantic, heavy red mechanical chess piece representing China is casting a massive shadow over a smaller, polished silver piece representing Korea. The red piece is pushing the silver piece off the board. Dramatic spotlight, metallic textures, depth of field, high-end 3D render style.",
  "Part 6": "A close-up of a glowing, futuristic semiconductor chip floating in the air. It is bright and pristine. However, the camera angle reveals that behind this bright chip, there is a pile of rusting gears and crumbling concrete representing the rest of the economy. The chip acts as a mask hiding the decay. Cyberpunk meets ruin aesthetic.",
  "Part 7": "A digital visualization of a bridge made of light data streams connecting a dim map of the Korean peninsula to a brightly glowing map of the USA. Silhouettes of young professionals (2030 generation) are walking across this bridge towards the light. Neon blue and gold color palette, futuristic financial motion graphics style.",
  "Part 8": "A cold, grey stock trading floor with cracked tiles. Faceless figures in business suits (foreign investors) are turning their backs to the camera and walking away into a bright white void, carrying briefcases. The scene feels cold and abandoned. Motion blur on the walking figures, cinematic composition, sense of departure.",
  "Part 9": "A hyper-realistic hourglass sitting on a wooden desk. The top bulb is almost empty. Inside the bottom bulb, instead of sand, there is a miniature desolate landscape with an elderly figure sitting alone. Outside the window behind the desk is a setting sun. Melancholic mood, warm sunset lighting, detailed glass texture.",
  "Part 10": "A towering Korean apartment complex floating in the air, but it is heavily weighed down by massive, rusty iron chains that drag it towards a dark abyss below. The building looks fragile, like a house of cards. Dark, stormy atmosphere, low angle shot to emphasize the scale and weight, surrealistic horror style.",
  "Part 11": "A monumental, golden statue of a 'King' sitting on a throne, but the head of the statue is the US Dollar sign ($). The statue is massive and intimidating, illuminated by god-rays from above. At its feet, small broken symbols of other currencies (Won, Yen) lie in the dust. Epic, cinematic scale, high contrast gold and shadow.",
  "Part 12": "A tense cinematic shot of a man in a suit balancing on a fraying tightrope over a deep chasm. In one hand he holds a shield, in the other a heavy bomb with a lit fuse. He is sweating and focused. Spotlight on the figure, surrounding is pure darkness. Symbolizing the government's dilemma.",
  "Part 13": "Close-up of a daily life scene: A hand holding a cup of coffee and an iPhone. The price tags attached to these items are physically burning and turning into ash, revealing higher numbers underneath. The background is a blurred, busy Seoul street. Dynamic, urgent atmosphere, vivid colors, realistic fire effects.",
  "Part 14": "A split-screen effect using a mirror. A businessman stands in front of a mirror. In reality, he looks normal, but the reflection shows him looking smaller and wearing worn-out clothes. The mirror frame is made of US Dollar bills. Conceptual art, moody lighting, symbolizing the 'illusion of wealth' depending on currency perspective.",
  "Part 15": "A panel of 'experts' in suits sitting at a news desk. They are all wearing blindfolds and their mouths are taped shut. Behind them, a large screen shows a graph crashing downwards in red. High contrast, slightly distorted camera angle to create a sense of unease and criticism. TV news studio setting.",
  "Part 16": "Two metallic humanoid figures submerged underwater. One representing Japan, one representing Korea. They are tied together by a heavy chain. The Japan figure is sinking deeper, pulling the Korea figure down with it. Dark blue underwater lighting, bubbles, sense of struggle and drag. Cinematic drama.",
  "Part 17": "A lone figure standing on a cliff edge looking out at a landscape that has permanently changed from a green valley to a harsh, rocky desert. The sky is a permanent grey. The figure holds a survival kit. Gritty realism, desaturated colors, 'The Road' movie vibe, symbolizing the acceptance of a harsh new environment.",
  "Part 18": "A high-end, top-down photography shot of an open safe. Inside, the space is neatly divided. One section holds gold bars, another holds US Dollar stacks, and another holds stock certificates. The lighting is warm and luxurious, highlighting the textures of the assets. Symbol of wise asset allocation.",
  "Part 19": "Wide cinematic ocean shot. A massive cargo ship (The State) is plowing through rough waves, staying its course. A small, agile lifeboat (The Individual) has detached and is steering away towards a calm, glowing lighthouse in the distance. Contrast between the dangerous large ship and the safe small boat.",
  "Part 20": "A close-up of a determined person looking at a holographic shield floating in front of them. The shield displays a diversified investment portfolio pie chart. Outside the shield, financial red arrows and storm debris are bouncing off. The person's face is illuminated by the warm, safe light of the shield. Hopeful, futuristic, cinematic finale."
}